submission_logs/2_2_two_middlewares/8/16/0-1/2/memtier/4.log
1         Threads
16        Connections per thread
80        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets           0.00          ---          ---      0.00000         0.00 
Gets         455.80       451.22         4.59     35.09300      1827.78 
Waits          0.00          ---          ---      0.00000          --- 
Totals       455.80       451.22         4.59     35.09300      1827.78 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
---
GET       1.600         0.00
GET       1.700         0.01
GET       1.800         0.02
GET       1.900         0.03
GET       2.000         0.05
GET       2.100         0.07
GET       2.200         0.09
GET       2.300         0.11
GET       2.400         0.15
GET       2.500         0.19
GET       2.600         0.22
GET       2.700         0.23
GET       2.800         0.25
GET       2.900         0.25
GET       3.000         0.26
GET       3.100         0.26
GET       3.200         0.27
GET       3.300         0.28
GET       3.400         0.30
GET       3.500         0.30
GET       3.600         0.30
GET       3.800         0.31
GET       3.900         0.31
GET       4.100         0.31
GET       4.200         0.32
GET       4.400         0.32
GET       4.600         0.33
GET       4.700         0.33
GET       4.900         0.34
GET       5.000         0.35
GET       5.100         0.36
GET       5.200         0.37
GET       5.300         0.37
GET       5.400         0.38
GET       5.500         0.39
GET       5.600         0.40
GET       5.700         0.41
GET       5.800         0.42
GET       5.900         0.43
GET       6.000         0.43
GET       6.100         0.44
GET       6.200         0.44
GET       6.300         0.45
GET       6.400         0.46
GET       6.500         0.47
GET       6.600         0.49
GET       6.700         0.50
GET       6.800         0.51
GET       6.900         0.53
GET       7.000         0.53
GET       7.100         0.54
GET       7.200         0.55
GET       7.300         0.56
GET       7.400         0.56
GET       7.500         0.57
GET       7.600         0.58
GET       7.700         0.60
GET       7.800         0.60
GET       7.900         0.61
GET       8.000         0.62
GET       8.100         0.63
GET       8.200         0.63
GET       8.300         0.64
GET       8.400         0.65
GET       8.500         0.66
GET       8.600         0.67
GET       8.700         0.68
GET       8.800         0.69
GET       8.900         0.70
GET       9.000         0.72
GET       9.100         0.73
GET       9.200         0.75
GET       9.300         0.78
GET       9.400         0.80
GET       9.500         0.80
GET       9.600         0.81
GET       9.700         0.81
GET       9.800         0.83
GET       9.900         0.83
GET      10.000         0.87
GET      11.000         0.94
GET      12.000         1.03
GET      13.000         1.28
GET      14.000         1.74
GET      15.000         3.47
GET      16.000         5.64
GET      17.000         6.55
GET      18.000         7.20
GET      19.000         7.63
GET      20.000         8.02
GET      21.000         8.40
GET      22.000         8.66
GET      23.000         8.84
GET      24.000         9.00
GET      25.000         9.31
GET      26.000         9.62
GET      27.000         9.97
GET      28.000        10.55
GET      29.000        11.72
GET      30.000        14.23
GET      31.000        27.44
GET      32.000        48.96
GET      33.000        61.15
GET      34.000        63.52
GET      35.000        64.45
GET      36.000        65.28
GET      37.000        66.15
GET      38.000        66.78
GET      39.000        67.29
GET      40.000        67.82
GET      41.000        68.49
GET      42.000        69.21
GET      43.000        70.37
GET      44.000        74.29
GET      45.000        85.13
GET      46.000        94.15
GET      47.000        97.29
GET      48.000        97.92
GET      49.000        98.26
GET      50.000        98.54
GET      51.000        98.72
GET      52.000        98.88
GET      53.000        99.01
GET      54.000        99.08
GET      55.000        99.18
GET      56.000        99.25
GET      57.000        99.33
GET      58.000        99.45
GET      59.000        99.50
GET      60.000        99.62
GET      61.000        99.74
GET      62.000        99.79
GET      63.000        99.84
GET      64.000        99.86
GET      65.000        99.90
GET      66.000        99.92
GET      67.000        99.92
GET      68.000        99.96
GET      69.000        99.96
GET      70.000        99.97
GET      71.000        99.98
GET      72.000        99.98
GET      73.000        99.99
GET      74.000        99.99
GET      76.000        99.99
GET      78.000        99.99
GET      83.000       100.00
---